pitzDaily_test/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    // Tested with kEpsilon, realizableKE, kOmega, kOmegaSST, v2f,
    // ShihQuadraticKE, LienCubicKE.
    model           kEpsilon;

    turbulence      on;

    printCoeffs     on;
    
    // These are the values of the k-epsilon model by default
    Cmu             0.09;
    C1              1.44;
    C2              1.92;
    C3              0.0;
    sigmak          1.0;
    sigmaEps        1.3;
    
    // These are the targeted values
    /*Cmu 	    0.55;
    C1		    2.0;
    C2		    0.5;
    C3		    0.0; // This is not a constant of k-epsilon, so we leave the same value as by default
    sigmak	    2.0;
    sigmaEps	2.0;*/	
}


// ************************************************************************* //
